#ifndef  __G7_COMMON_PACKET_20050220__
#define  __G7_COMMON_PACKET_20050220__

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include "COMMON.h"

#define MAX_BUFSIZE		1024L
#define MAX_FILESIZE	4096L
#define	MAX_TRSIZE		2048L
#define	MAX_SENDSIZE	4096L
#define	LEN_SIZE		4L
#define CORRECT_LEN		6L
#define MAX_UPGRADE		6144L	//	6k
#define MAX_LOGGING		1024

#define MAX_ACNT_NO		11
#define MAX_USERID		12
#define MAX_STK_CODE	32
#define MAX_GDS_CODE	2
#define MAX_ARTC_CODE	10
#define MAX_ORD_NO		9
#define MAX_ORD_QTY		9
#define MAX_ORD_PRC		20
#define MAX_ORD_PRC_DOT	8

#define MAX_ORD_NO_EX		(20)	// ++ skeo 2011-04-29	

#define SET_USERID(id)	{							\
	char temp[MAX_USERID+1];						\
	int	len = min( MAX_USERID, strlen(id) );		\
	sprintf( temp, "%-*.*s", MAX_USERID, len, id);	\
	strcpy( id, temp);								\
}

#define	SET_LEN( i_len, o_len ) sprintf( o_len, "%0*d", LEN_SIZE, i_len-CORRECT_LEN )

//#define USE_USERCCYPL	1

//########################################################
//##	//HEADER, C_HEADER 가 붙은 패킷은
//##	Stx, Etx 를 붙여서 통신해야 한다.
//#########################################################


/**	\brief	CLIENT - SERVER 간 헤더
*/
typedef struct  _ST_CLIENT_HEADER
{
	char	Len		[LEN_SIZE];		// 길이 
	char	Code	[5];		// 코드 
}C_HEADER, * LPCLIENT_HEADER;	//	9
#define C_HEADER_LEN	sizeof(C_HEADER)

/**	\brief	CLIENT - SERVER 간 TR 패킷에 사용하는 TR //HEADER

	*	//HEADER + TRHEADER

	*	MsgGb	: 결과코드 (N, E)
		EndGb	: 패킷이 여러개 전송될 때 마지막 패킷인지 여부
		DataHeaderSize : TR_HEADER 다음 정보가 있을 때 해당 정보를 저장하는 SIZE
*/
typedef struct _TR_HEADER
{
	char	MsgGb	[1];		//	'N' OK, 'E' ERROR
	char	MsgCode	[4];
	char	FormNo	[4];
	char	EndGb	[1];		//	1: end, 0:not end
	char	DataHeaderSize[4];	//	14
}TR_HEADER, * LPTR_HEADER;

#define TRHEADER_ENDGB_END	'1'
#define TRHEADER_ENDGB_NEXT	'0'
#define TRHEADER_MSGGB_OK	'N'
#define TRHEADER_MSGGB_ERR	'E'

/*==================================================================================
/////////////		UPGRADE PACKET		/////////////
==================================================================================*/
/**	\brief	업그레이드용 패킷 중 CLIENT 가 SERVER 로 전송하는 패킷

	*	Complete	:	직전에 다운로드가 완료되었는지 여부 (0-미완, 1-완료)
	*	LastDate	:	최종 다운로드 일자
	*	FileName	:	직전 다운로드가 완료되지 않았을 때(Complete 가 0 일때)
						최종적으로 다운로드한 파일명
*/
typedef struct _ST_UPGRADE_TR
{
	char		STX			[1];
	C_HEADER	Header;
	TR_HEADER	TRHeader;
	char		Complete	[1];	// 직전 다운로드완료여부 (0-미완  1-완료)
	char		LastDate	[14];	// YYYYMMDDHHMMSS
	char		FileName	[32];	// 파일 이름. client 에서 직전 다운로드가 완전하지 않으면 
									// 올릴때 최종 파일명을 넘긴다.	
	char		FilePath	[32];	// 최종 디렉토리 (Root 인 경우는 space)
	char		ETX			[1];
} ST_UPGRADE_TR, *PTR_UPGRADE_TR;
#define SIZE_UPGRADE_TR	sizeof(ST_UPGRADE_TR)

/**	\brief	업그레이드 파일 중 SERVER 가 CLIENT 에게 전송하는 패킷

	*	한 파일이 여러번 전송되어야 할 때 최초 전송하는 패킷

	*	FileFirstCheck	:	1 - 파일 최초, 0 - 최초 아니다, 2 - 파일이 없다.
		FileLastCheck	:	1 - 마지막, 0 - 마지막 아니다.
		Binary			:	실제 파일의 데이터
*/
typedef struct _PKT_UPGRADE 
{
	char		STX			[1];
	C_HEADER	Header;
	TR_HEADER	TRHeader;
	char		FileFirstCheck[1];	// 1 - 파일 최초, 0 - not, 2 - 파일 없다.
	char		FileLastCheck[1];	// 1 - 파일 마지막, 0 - not
	char		FileCnt		[4];		// 업그레이드 할 파일 갯수
	char		FileDate	[14];	// YYYYMMDDHHMMSS
	char		FileName	[32];	// 파일 이름
	char		FilePath	[32];	// 경로
	char		FileSize	[8];	// 파일 크기	:: 이상 Data Header

	char		Binary[MAX_FILESIZE];

	char		ETX[1];
} PKT_UPGRADE, *PTR_PKT_UPGRADE;
#define SIZE_PKT_UPGRADE sizeof(PKT_UPGRADE)


/**	\brief	업그레이드 파일 중 SERVER 가 CLIENT 에게 전송하는 패킷

	*	한 파일이 여러번 전송되어야 할때 최초 다음에 전송하는 패킷
*/

typedef struct _PKT_UPGRADE_NEXT
{
	char				STX[1];
	C_HEADER			Header;
	TR_HEADER			TRHeader;
	char				FileFirstCheck[1];
	char				FileLastCheck[1];
	char				Binary[MAX_FILESIZE];
	char				ETX[1];
} PKT_UPGRADE_NEXT, *PTR_PKT_UPGRADE_NEXT;
#define SIZE_PKT_UPGRADE_NEXT	sizeof(PKT_UPGRADE_NEXT)



typedef struct _PKT_TR
{
	char			STX[1];
	C_HEADER		Header;
	TR_HEADER		TRHeader;
	char			Data[MAX_TRSIZE];
	char			ETX[1];
}PKT_TR, *PTR_PKT_TR;



//////////////////////////////////////////////////////////////////////////
//	LOGIN PACKET
typedef struct _ST_TR_00013_C
{
	char	STX		[1];
	C_HEADER		Header;
	TR_HEADER		TRHeader;
	char			UserID				[MAX_USERID];
	char			Conn_Pwd			[10];
	char			CLIENT_IP_LOCAL		[15];
	char			CLIENT_IP_PUBLIC	[15];
	char			CLIENT_MAC			[12];
	char			Reserved			[100];
	char			ETX					[1];
}ST_TR_00013_C;

typedef struct _ST_TR_00013_S
{
	char	STX		[1];
	C_HEADER		Header;
	TR_HEADER		TRHeader;
	char			UserID		[MAX_USERID]; 	
	char			SERVER_IP	[15];
	char			SERVER_PORT	[5]; 	
	char			Reserved	[100];
	char			ETX			[1];
}ST_TR_00013_S;


//////////////////////////////////////////////////////////////////////////
//	LOGIN COMMIT PACKET
typedef struct _ST_TR_00014_C
{
	char	STX		[1];
	C_HEADER		Header;
	TR_HEADER		TRHeader;
	char			UserID				[MAX_USERID];
	char			CLIENT_IP_LOCAL		[15];
	char			CLIENT_IP_PUBLIC	[15];
	char			CLIENT_MAC			[12];
	char			Reserved			[100];
	char			ETX					[1];
}ST_TR_00014_C;

typedef struct _ST_TR_00014_S
{
	char	STX		[1];
	C_HEADER		Header;
	TR_HEADER		TRHeader;
	char			UserID		[MAX_USERID]; 	
	char			Reserved	[100];
	char			ETX			[1];
}ST_TR_00014_S;

//	FRONT RELOAD
typedef struct _ST_TR_00018
{
	char		STX			[ 1];
	C_HEADER	Header			;
	TR_HEADER	TRHeader		;
	char		ETX			[ 1];
}ST_TR_00018;

//////////////////////////////////////////////////////////////////////////
//	주문
typedef struct _ST_TR_20000
{
	char		STX	[1];
	C_HEADER	Header;
	TR_HEADER	TRHeader;

	char		GDS_CODE	[2];
	char		UserID		[MAX_USERID];
	char		AcntPwd		[4];
	char		ACNT_NO		[MAX_ACNT_NO];
	char		STK_CODE	[MAX_STK_CODE];
	char		ORD_ST		[1];			//	시장가, 지정가, ..
	char		COND_ORD_ST	[1];
	char		BUY_SELL_TP	[1];			//	1:SELL, 2:BUY
	char		ORD_PROC_TP	[1];			//	신규, 정정, 취소
	char		ORG_ORD_NO	[MAX_ORD_NO];	//	
	char		ORG_ORD_PRC	[MAX_ORD_PRC];	//	20,8 (소수이하 8)	//	취소/정정 주문에만 사용

	char		ORD_PRC		[MAX_ORD_PRC];	//	신규주문가격, 정정인 경우 정정가격 ONLY, 20,8 (소수이하 8)
	char		ORD_QTY		[MAX_ORD_QTY];	//	주문수량
// 	char		MDFY_ORD_PRC[20];			//	정정주문 ONLY 20,8 (소수이하 8)
// 	char		MDFY_ORD_QTY[9];			//	정정주문인 경우 ONLY
// 	char		CNCL_ORD_QTY[9];			//	취소주문인 경우 ONLY
	char		ALL_YN		[1];			//	ALL Cancel/Modify? or Partially cancel/modify?
	char		MKT_RNG		[3];			//	Slippage 범위
	char		SL_PRC		[MAX_ORD_PRC];	//	20,8 (소수이하 8)//	조건주문(STOP/LIMIT) 주문환율
	char		TS_RNG		[3];			//	TS 범위 (TICK)
	char		IFD_YN		[1];
	char		ORD_TERM_TP	[1];
	char		FCM_CODE	[5];
	char		FORCE_ORD_YN[1];			//	 
	char		MNG_USERID	[MAX_USERID];
	
	//char		ORG_ORD_NO_FU[MAX_ORD_NO_EX];//	하나대투 해외선물 주문번호. ++ skeo 2011-04-29		

	char		ETX	[1];
}ST_TR_20000;


// 동양선물(FU) 주문 패킷
typedef struct _DONGYANG_FU_TR_20000_I
{
	char		API_USERID		[MAX_USERID];
	char		API_ACNT_NO		[MAX_ACNT_NO];
	char		API_ACNT_PWD	[4];
	char		STK_CODE		[MAX_STK_CODE];
	char		ORD_PRC			[MAX_ORD_PRC];	//	신규주문가격, 정정인 경우 정정가격 ONLY, 20,8 (소수이하 8)
	char		ORD_QTY			[MAX_ORD_QTY];	//	주문수량
	char		BUY_SELL_TP		[1];			//	1:매수, 2:매도
	char		ORD_ST			[1];			//	1: 지정가, 2: 시장가
	char		ORD_TERM_TP		[1];			//	1: FAS, 3: FAS
	char		ORD_ST2			[1];			//	1: 일반, 2: STOP
	char		STOP_PRC		[MAX_ORD_PRC];	//	STOP ORDER 지정가격
	char		CLORD_NO		[MAX_ORD_NO];
	char		PROC_TP			[1];			// 1:NEW, 2:MODIFY, 3:CANCEL
	char		ORG_ORD_NO		[MAX_ORD_NO];	// Modify and Cancel Order
}DONGYANG_FU_TR_20000_I;


// 하나대투(KS) 주문 패킷
typedef struct _HANADT_FU_TR_20000_I
{
	char		Rcnt		[4];	// 처리 건수
	char		Odgb		[1];	// 1:일반, 2:선물옵션
	char		Mkgb		[1];	// 1:거래소, 2:코스닥, 3:프리보드, 5:장외
	char		Mmgb		[1];	// 1:매도, 2:매수, 3:정정, 4:취소
	char		Acno		[10];
	char		Pswd		[8];
#if _NO_NINE	// 주문번호자릿수 9 자리 (SAEHAN, BLASH 실전만))
	char		Ogno		[12];	// 정정/취소시 원주문번호
#else
	// ++ skeo 2011-04-29	
	char		Ogno		[MAX_ORD_NO_EX];	// 정정/취소시 원주문번호	
#endif
	char		Code		[12];	// 단축코드
	char		Jqty		[8];	// 주문수량
	char		Jprc		[10];	// 주문가격(선물옵션의 경우 100배수 처리 [ex] 112.13 -> 11213
	char		Hogb		[2];	// 00:지정가, 03:시장가, 05:조건부지정가, 06:최유리지정가, 07:최우선지정가
	char		Jmgb		[2];	// 01:IOC, 02:FOK
	char		Mdgb		[1];	// 1:일부, 2:전부
	char		Prgb		[1];	// 'X'
}HANADT_FU_TR_20000_I;


//	OrdChk class 에서 반환할 정보
typedef struct _ST_SV_ORD_CHK_RSLT
{
	char			MINI_YN		[1];	//	MINI 고객 여부
	char			API_CODE	[11];
	char			API_ACNT_NO	[20];
	char			API_PWD		[10];
	char			ClORD_NO	[MAX_ORD_NO];	//	우리가 생성한 주문번호
	char			ORD_PRC		[MAX_ORD_PRC];
	char			ORD_QTY		[MAX_ORD_QTY];
//	char			SERVER_IP	[15];
	char			ORD_TM		[9];	//	HHMMSSmmm
	char			API_USERID	[MAX_USERID];
	char			NTTN_CODE	[2];
	char			Reserved	[6];	//오토봇. 2byte 를 체결율에 사용한다.(%값)
	ST_TR_20000		stC;
	
}ST_SV_ORD_CHK_RSLT;




/************************************************************************
	API 와의 관계
************************************************************************/

//	IF 프로그램이 MQ 에 넣을 때 채워야 할 정보
typedef struct	_ST_MQLABEL_API_INFO
{
	char	CODE		[2];			//	TR, RL
	char	GDS_CODE	[2];
	char	API_CODE	[11];
	char	NTTN_CODE	[2];	//	해당 종목의 진법코드
}ST_MQLABEL_API_INFO;

// 하나대투 해외선물 주문번호 길이. skeo 2011-04-29		
#define HANADT_FU_ORDER_NO_LEN		14	

//	각 API에서 받은 주문TR 응답데이터를 변환할 공통 포맷
typedef struct _ST_IFRECV_TR_ORD
{
	char	GDS_CODE	[2];
	char	CLORD_NO	[MAX_ORD_NO];	//	CLIENT ORDER NO
#if _NO_NINE	// 주문번호자릿수 9 자리 (SAEHAN, BLASH 실전만))
	char	ORD_NO		[MAX_ORD_NO];	//	API ORD NO
#else
	// ++ skeo 2011-04-29	
	char	ORD_NO		[MAX_ORD_NO_EX];	//	API ORD NO
#endif
	char	RSLT_CODE	[4];			//	성공여부를 우리의 RET_CODE 값으로 표현(RET_SUCCESS or RET_ORD_RJCT)
	char	API_CODE	[11];
	char	API_MSGCODE	[6];
	char	API_MSG		[100];
}ST_IFRECV_TR_ORD;

//	각 API에서 받은 체결REAL 응답데이터를 변환할 공통 포맷
typedef struct _ST_IFRECV_REAL_CNTR
{
	char	ORD_RSLT_CODE	[4];	//	0~3	9000(신규주문)/9001(정정)/9002(취소)/9003(거부)/9004(체결)/9005(주문TR)
	char	GDS_CODE		[2];	//	4~5
	char	API_CODE		[11];	//	6~16
	char	STK_CODE		[MAX_STK_CODE];	//	17~48
	char	API_USERID		[MAX_USERID];	//	49~60
	char	API_ACNT_NO		[20];			//	61~80
#if _NO_NINE	// 주문번호자릿수 9 자리 (SAEHAN, BLASH 실전만))
	char	API_ORD_NO		[MAX_ORD_NO];	//	81~89
	char	ClORD_NO		[MAX_ORD_NO];	//	82~98
	char	API_ORD_ORG_NO	[MAX_ORD_NO];	//	99~107
	char	API_CNTR_NO		[MAX_ORD_NO];	//	108~116
#else
	// ++ skeo 2011-04-29	
	char	API_ORD_NO		[MAX_ORD_NO_EX];	//	
	char	ClORD_NO		[MAX_ORD_NO];		//	
	char	API_ORD_ORG_NO	[MAX_ORD_NO_EX];	//	
	char	API_CNTR_NO		[MAX_ORD_NO_EX];	//	
#endif
	char	API_MKT_TP		[1];		//	시장구분(1/5/6/7)
	char	ORD_ST			[1];
	char	PROC_TP			[1];
	//char	ACPT_TP			[1];
	char	BUY_SELL_TP		[1];
	char	ORD_QTY			[MAX_ORD_QTY];
	char	ORD_PRC			[MAX_ORD_PRC];
	char	CNTR_QTY		[MAX_ORD_NO];
	char	CNTR_PRC		[MAX_ORD_PRC];
	char	REMN_QTY		[MAX_ORD_NO];		//	미체결잔량
	char	API_RJCT_CODE	[4];		//	거부시만,
	char	API_RJCT_MSG	[40];		//	거부시만
	char	DT				[8];
	char	TM				[9];		//	hhmmssmmm
}ST_IFRECV_REAL_CNTR;


//////////////////////////////////////////////////////////////////////////
//	MINI 를 위한 패킷
// typedef struct _ST_MINI_TR_ORD_I
// {
// 	char	incnt		[4];	//	주문카운트 (zero padding)
// 	char	mapno		[5];	//	TR 사용하는 MAP 번호
// 	char	clikey		[9];	//	주문key(zero padding)
// 	char	gb			[1];	//	1:매도, 2:매수, 3:정정, 4:취소
// 	char	zAcntNo		[20];	//	'-'는 모두 제거. (space trailing)
// 	char	zInptPwd	[8];	//	계좌비밀번호
// 	char	zFnoIsuNo	[15];	//	종목코드(space trailing)
// 	char	lOrgOrdNo	[9];	//	zero padding
// 	char	Ord_ST		[2];	//	00(지정가), 03(시장가), 05(조건부지정가), 06(최유리지정가)
// 	char	dOrdPrc		[12];	//	zero padding
// 	char	lOrdQty		[15];	//	zero padding
// 	char	ip			[12];	//	199.99.9.90 -> 199099009090
// 	//	이상 동부 API 그대로
// 	
// 	char	ord_term_tp	[1];	//	DAILY, GTC, FOK, IOC
// }ST_MINI_TR_ORD_I;
// 
// typedef struct _ST_MINI_TR_ORD_O
// {
// 	char	outcnt		[4];	//	주문카운트 (zero padding)
// 	char	clikey		[9];	//	주문key(zero padding)
// 	char	lOrdNo		[9];	//	0 이하일 경우 주문장애
// 	char	msgcd		[6];	//	
// 	char	msgcm		[100];	
// 	//	이상 동부 API 그대로
// 	
// 	char	ord_term_tp	[1];	//	DAILY, GTC, FOK, IOC
// 	
// }ST_MINI_TR_ORD_O;

//	주문패킷
typedef ST_SV_ORD_CHK_RSLT	ST_MINI_TR_ORD_I;
//	주문/체결 통보
typedef ST_IFRECV_REAL_CNTR	ST_MINI_REAL_CNTR;


//////////////////////////////////////////////////////////////////////////
//	NOTIFY REAL PACKET
typedef struct _ST_REAL_84901
{
	char		STX			[1];
	C_HEADER	Header;
	TR_HEADER	TRHeader;
	char		ItemCd		[2];	//	11:장마감전통보, 12:장마감통보
	char		Title		[80];	
	char		Data		[MAX_BUFSIZE];
	char		ETX			[1];
}ST_REAL_84901;




/*
//입출금실시간
  - 입출금컴포넌트(70302)에서 입출금확인 후 이 패킷을 클라이언트에 보내면
    클라이언트는 TR을 다시 날려 정보 갱신
*/
typedef struct _ST_REAL_84902
{
	char		STX			[1];
	C_HEADER	Header;
	TR_HEADER	TRHeader;
	char		RESERVED	[20];
	char		ETX			[1];
}ST_REAL_84902;


//	CLIENT 에게 전달할 주문/체결 결과 패킷
typedef struct _ST_REAL_82004
{
	char		STX			[1];
	C_HEADER	Header;
	TR_HEADER	TRHeader;

	char	ORD_RSLT_CODE	[4];
	char	GDS_CODE		[2];
	char	STK_CODE		[MAX_STK_CODE];
	char	USERID			[MAX_USERID];
	char	ACNT_NO			[MAX_ACNT_NO];
	char	ORD_NO			[MAX_ORD_NO];
	char	ORD_ORG_NO		[MAX_ORD_NO];
	char	CNTR_NO			[MAX_ORD_NO];
	char	ORD_ST			[1];
	char	PROC_TP			[1];
	char	ACPT_TP			[1];
	char	BUY_SELL_TP		[1];
	char	ORD_QTY			[MAX_ORD_QTY];
	char	ORD_PRC			[MAX_ORD_PRC];
	char	CNTR_QTY		[MAX_ORD_NO];
	char	CNTR_PRC		[MAX_ORD_PRC];
	char	REMN_QTY		[MAX_ORD_NO];		//	미체결잔량
	char	PRC_REMN_QTY	[MAX_ORD_QTY];
	char	DT				[8];
	char	TM				[9];				//	hhmmssmmm

	char	AFTER_CLR_PL_SUM[15];
	char	AFTER_POS_SUM	[MAX_ORD_QTY];		//	체결 후 포지션 수량 SUM
	char	AFTER_AVG_PRC	[MAX_ORD_PRC];
	char	AFTER_BUY_SELL_TP[1];

	char	AFTER_CAN_ORD_QTY_S	[4];	//	체결 후 매도 주문가능수량
	char	AFTER_CAN_ORD_QTY_B	[4];	//	체결 후 매수 주문가능수량

	char	NOW_PRC				[15];	//	현재가를 넣는다.
	char	CMSN				[5];
	char	STK_REMNQ_SELL		[4];	//	해당 종목의 미체결잔량 전체
	char	STK_REMNQ_BUY		[4];
	char	TOT_EVLT_AMT		[15];
	char	EVLT_AMT			[15];
	
	char	ETX			[1];
}ST_REAL_82004;

//	CLIENT 에게 전달할 실시간 잔고
typedef struct _ST_REAL_82005
{
	char		STX			[1];
	C_HEADER	Header;
	TR_HEADER	TRHeader;
	
	char	ACNT_NO			[MAX_ACNT_NO];
	char	USERID			[MAX_USERID];
	char	ACPT_TP			[1];
	char	STK_CODE		[MAX_STK_CODE];
	char	AFTER_CAN_ORD_QTY_S	[4];	//	체결 후 매도 주문가능수량
	char	AFTER_CAN_ORD_QTY_B	[4];	//	체결 후 매수 주문가능수량
	char	NOW_PRC				[20];	//	현재가를 넣는다.
	char	STK_REMNQ_SELL		[4];	//	해당 종목의 미체결잔량 전체
	char	STK_REMNQ_BUY		[4];
	char	AFTER_CLR_PL_SUM	[15];	//	해당종목 손익
	char	AFTER_POS_SUM		[MAX_ORD_QTY];		//	체결 후 포지션 수량 SUM
	char	AFTER_AVG_PRC		[MAX_ORD_PRC];
	char	AFTER_BUY_SELL_TP	[1];
	char	CMSN				[5];
	char	TOT_EVLT_AMT		[15];
	char	EVLT_AMT			[15];
	
	//	이하 20101124 김배완 추가
	char	AFTER_TOT_PL_SUM	[15];	//	전종목 손익
	char	AFTER_REMNQ_SELL	[4];	//	전종목 미체결잔량
	char	AFTER_REMNQ_BUY		[4];	//	전종목 미체결잔량	

	//	20101216 김배완 추가
	char	LossCutAmt			[15];	//	현포지션의 로스컷 금액
	char	ETX			[1];
}ST_REAL_82005;


//////////////////////////////////////////////////////////////////////////
//	시스템신호 송출 1 (특정계좌 수익정보)
typedef struct _ST_REAL_83005
{
	char		STX			[1];
	C_HEADER	Header;
	TR_HEADER	TRHeader;

	char	GROUP_IDX	[2];
	char	STK_CODE	[MAX_STK_CODE];
	char	POS_QTY		[15];
	char	AVG_PRC		[MAX_ORD_PRC];
	char	EVLT_PL		[15];
	char	CLR_PL		[15];
	char	TOT_PL		[15];
	char	ETX			[1];
}ST_REAL_83005;


//////////////////////////////////////////////////////////////////////////
//	MASTER FILE
typedef	struct _MASTER_KSF
{
	char	STK_CODE	[MAX_STK_CODE];	
	char	STK_NM		[30];	
	char	ARTC_CODE	[MAX_ARTC_CODE];	//	품목코드
	char	ARTC_NM		[30];	//	품목명
	char	NTTN_CODE	[2]; 	//	진법코드
	char	LSTNG_DT	[8];	//	상장일
	char	MTR_DT		[8];	//	만기일
	char	TICK_SIZE	[7];	//	xxxx.xx
	char	TICK_VALUE	[7];
} MASTER_KSF;


typedef	struct _MASTER_KSO
{
	char	STK_CODE		[MAX_STK_CODE];	
	char	STK_NM			[30];	
	char	ARTC_CODE		[MAX_ARTC_CODE];	//	품목코드
	char	ARTC_NM			[30];	//	품목명
	char	NTTN_CODE		[2]; 	//	진법코드
	char	LSTNG_DT		[8];	//	상장일
	char	MTR_DT			[8];	//	만기일
	char	STRK_PRC		[MAX_ORD_PRC];	//	STRIKE PRICE
	char	TICK_CHG_STND	[7];
	char	TICK_SIZE_1		[7];	//	xxxx.xx
	char	TICK_VALUE_1	[7];
	char	TICK_SIZE_2		[7];	//	xxxx.xx
	char	TICK_VALUE_2	[7];
}MASTER_KSO;


typedef	struct _MASTER_FU
{
	char	STK_CODE	[MAX_STK_CODE];	
	char	STK_NM		[30];	
	char	ARTC_CODE	[MAX_ARTC_CODE];	//	품목코드
	char	ARTC_NM		[30];	//	품목명
	char	NTTN_CODE	[2]; 	//	진법코드
	char	LSTNG_DT	[8];	//	상장일
	char	MTR_DT		[8];	//	만기일
	char	FND_DT		[8];	//	최종인도일
	char	TICK_SIZE	[7];	//	xxxx.xx
	char	TICK_VALUE	[7];
} MASTER_FU;


typedef	struct _MASTER_FX
{
	char	STK_CODE			[MAX_STK_CODE];	
	char	STK_NM				[30];	
	char	FCM_CODE			[12];
	char	FCM_NM				[30];
	char	DEAL_UNIT			[15];
	char	PIP_UNIT			[11];	//	XXXXX.XXXXX
	char	HOGA_UNIT			[11];	//	TICK SIZE
	char	PIP_VALUE_TP		[1];	//	1(미국식),2(유럽식),3(교차미국식),4(교차유럽식)
	char	PIP_VALUE_STK_CODE	[32];
} MASTER_FX;

typedef	struct _MASTER_MSG
{
	char	MSGCODE				[4];	
	char	MSG_KO				[200];	
	char	MSG_ENG				[200]; // ERROR MESSAGE 영문 버전
	char	MSG_CHINA			[200]; // ERROR MESSAGE 중국어 버전

} MASTER_MSG;


//	API 가 보내주는 MASTER FILE
typedef struct _API_MASTER_KSF
{
	char	STK_GB				[1];	//	무조건 'F'
	char	Filler_1			[1];	//	SPACE
	char	YearMon				[4];	//	2010년 3월이면 "1003 "
	char	Filler_2			[24];	//	SPACE
	char	STK_CODE			[8];
}API_MASTER_KSF;

typedef struct _API_MASTER_KSO
{
	char	CALL_PUT			[1];	//	C:CALL, P:PUT
	char	Filler_1			[1];	//	SPACE
	char	YearMon				[4];	//	2010년 3월이면 "1003 "
	char	Filler_2			[1];	//	SPACE
	char	STRK_PRC			[6];	//	행사가
	char	Filler_3			[1];	//	space
	char	STK_CODE			[8];
}API_MASTER_KSO;


//////////////////////////////////////////////////////////////////////////
//	KOSPI200 선물/옵션 현재가 공통 포맷 (81003)
typedef struct _REAL_SISE_KS
{
	char	STX					[1];
	C_HEADER				Header;
	TR_HEADER				TRHeader;

	char	stk_code			[MAX_STK_CODE];		//32
	char	gds_code			[2];	// 2	KSF, KSO 구분 2010/07/26 추가	//34
	char	tm					[6];											//40
	char	now_prc				[7];	//	xxxx.xx								//47
	char	open				[7];	//	2									//54
	char	high				[7];	//	2									//61
	char	low					[7];	//	2									//68
	char	acml_cntr_qty		[7];	//	0	누적체결수량					//75
	char	acml_buy_cntr_qty	[6];	//	0	누적매수체결량	//	사용하지 않음	//81
	char	buy_sell_tp			[1];												//82
	char	acml_amt			[15];	//	0	누적거래대금						//97
	char	daebi_sign			[1];	//	0	전일대비부호						//98
	char	chg					[7];	//	2	전일대비							//105
	char	chg_rate			[7];	//	2	등락율
	char	cntr_qty			[6];	//	0	체결수량
	char	o_hoga_1			[7];	//	2	
	char	o_hoga_2			[7];	//	2	
	char	b_hoga_3			[7];	//	2	
	char	o_hoga_4			[7];	//	2	
	char	o_hoga_5			[7];	//	2	
	char	o_rmnq_1			[6];	//	0	매도잔량
	char	o_rmnq_2			[6];	//	0	
	char	o_rmnq_3			[6];	//	0	
	char	o_rmnq_4			[6];	//	0	
	char	o_rmnq_5			[6];	//	0
	char	o_trmnq				[6];	//	총매도호가잔량
	char	o_cnt_1				[4];	//	
	char	o_cnt_2				[4];	//	
	char	o_cnt_3				[4];	//	
	char	o_cnt_4				[4];	//	
	char	o_cnt_5				[4];	//	
	char	o_tot_cnt			[5];	//	0	총매도건수
	char	o_hoga_cnt_chg_1	[4];	//	0	매도호가건수대비
	char	o_hoga_cnt_chg_2	[4];	//	0	
	char	o_hoga_cnt_chg_3	[4];	//	0	
	char	o_hoga_cnt_chg_4	[4];	//	0	
	char	o_hoga_cnt_chg_5	[4];	//	0	
	char	b_hoga_1			[7];	//	2	
	char	b_hoga_2			[7];	//	2	
	char	o_hoga_3			[7];	//	2	
	char	b_hoga_4			[7];	//	2	
	char	b_hoga_5			[7];	//	2	
	char	b_rmnq_1			[6];	//	0	매수잔량
	char	b_rmnq_2			[6];	//	0	
	char	b_rmnq_3			[6];	//	0	
	char	b_rmnq_4			[6];	//	0	
	char	b_rmnq_5			[6];	//	0	
	char	b_trmnq				[6];	//		총매수호가잔량
	char	b_cnt_1				[4];	//	
	char	b_cnt_2				[4];	//	
	char	b_cnt_3				[4];	//	
	char	b_cnt_4				[4];	//	
	char	b_cnt_5				[4];	//	
	char	b_tot_cnt			[5];	//	0	총매수건수
	char	b_hoga_cnt_chg_1	[4];	//	0	
	char	b_hoga_cnt_chg_2	[4];	//	0	
	char	b_hoga_cnt_chg_3	[4];	//	0	
	char	b_hoga_cnt_chg_4	[4];	//	0	
	char	b_hoga_cnt_chg_5	[4];	//	0	
	char	ks200				[7];	//	2	
	char	hoga_trmnq_chg		[7];	//	0	호가총잔량차이
	char	qty_chg				[9];	//		거래량증감
	char	amt_chg				[9];	//		거래대금증감
	char	theory_prc			[7];	//	2	이론가
	char	open_yak			[7];	//	0	미결제약정수량(부호)-옵션만부호있음
	char	open_yak_chg		[6];	//		미결제약정수량대비
	char	gyuri_rate			[7];	//	2	괴리율
	char	basis				[7];	//	2	시장베이시스
	char	open_chg			[7];	//	2	시가대비
	char	high_chg			[7];	//	2	고가대비
	char	low_chg				[7];	//	2	저가대비
	char	theory_basis		[7];	//	2	이론베이시스
	char	imp_v				[7];	//		내재변동성 - OPTION ONLY
	char	delta				[7];	//		델타 - OPTION ONLY
	char	gmma				[7];	//		감마 - OPTION ONLY
	char	veta				[7];	//		베타 - OPTION ONLY
	char	theta				[7];	//		세타 - OPTION ONLY
	char	rho					[7];	//		로 - OPTION ONLY
	char	in_val				[6];	//		내재가치 - OPTION ONLY
	char	tm_value			[6];	//		시간가치 - OPTION ONLY
	char	cntr_net_buy		[9];	//		체결순매수 - OPTION ONLY
	char	rmnq_gap			[7];	//		잔량차(매수잔량-매도잔량) - OPTION ONLY
	char	cnt_gap				[5];	//		건수차(매수건수-매도건수) - OPTION ONLY
	
	char	ETX					[1];

}REAL_SISE_KS;		// 508


//////////////////////////////////////////////////////////////////////////
//	KOSPI200 선물옵션 현재가 (TR:21004, REAL:81004)
typedef struct _REAL_NOW_PRC
{
	char	STX					[1];
	C_HEADER				Header;
	TR_HEADER				TRHeader;
	char	STK_CODE	[MAX_STK_CODE];
	char	NOW_PRC		[7];
	char	ETX					[1];

}REAL_NOW_PRC;

//////////////////////////////////////////////////////////////////////////
//	KOSPI200 선물/옵션 호가 공통 포맷 (81103)
typedef struct _REAL_HOGA_KS
{
	char	STX					[1];
	C_HEADER				Header;
	TR_HEADER				TRHeader;
	
	char	stk_code			[MAX_STK_CODE];	//패킷크기 때문에 'MAX_STK_CODE'(32) 아닌 '8'Byte
	char	gds_code			[2];	// 2	KSF, KSO 구분 2010/07/26 추가
	char	tm					[6];
	char	o_hoga_1			[7];	//	2	
	char	o_hoga_2			[7];	//	2	
	char	o_hoga_3			[7];	//	2	
	char	o_hoga_4			[7];	//	2	
	char	o_hoga_5			[7];	//	2	
	char	o_rmnq_1			[6];	//	0	매도잔량
	char	o_rmnq_2			[6];	//	0	
	char	o_rmnq_3			[6];	//	0	
	char	o_rmnq_4			[6];	//	0	
	char	o_rmnq_5			[6];	//	0
	char	o_trmnq				[6];	//	총매도호가잔량
	char	o_cnt_1				[4];	//	
	char	o_cnt_2				[4];	//	
	char	o_cnt_3				[4];	//	
	char	o_cnt_4				[4];	//	
	char	o_cnt_5				[4];	//	
	char	o_tot_cnt			[5];	//	0	총매도건수
// 	char	o_hoga_cnt_chg_1	[4];	//	0	매도호가건수대비
// 	char	o_hoga_cnt_chg_2	[4];	//	0	
// 	char	o_hoga_cnt_chg_3	[4];	//	0	
// 	char	o_hoga_cnt_chg_4	[4];	//	0	
// 	char	o_hoga_cnt_chg_5	[4];	//	0	
	char	b_hoga_1			[7];	//	2	
	char	b_hoga_2			[7];	//	2	
	char	b_hoga_3			[7];	//	2	
	char	b_hoga_4			[7];	//	2	
	char	b_hoga_5			[7];	//	2	
	char	b_rmnq_1			[6];	//	0	매수잔량
	char	b_rmnq_2			[6];	//	0	
	char	b_rmnq_3			[6];	//	0	
	char	b_rmnq_4			[6];	//	0	
	char	b_rmnq_5			[6];	//	0	
	char	b_trmnq				[6];	//		총매수호가잔량
	char	b_cnt_1				[4];	//	
	char	b_cnt_2				[4];	//	
	char	b_cnt_3				[4];	//	
	char	b_cnt_4				[4];	//	
	char	b_cnt_5				[4];	//	
	char	b_tot_cnt			[5];	//	0	총매수건수
// 	char	b_hoga_cnt_chg_1	[4];	//	0	
// 	char	b_hoga_cnt_chg_2	[4];	//	0	
// 	char	b_hoga_cnt_chg_3	[4];	//	0	
// 	char	b_hoga_cnt_chg_4	[4];	//	0	
// 	char	b_hoga_cnt_chg_5	[4];	//	0	
// 	char	hoga_trmnq_chg		[7];	//	0	호가총잔량차이
	
	char	ETX					[1];
	
}REAL_HOGA_KS;		// 281 (234)


//////////////////////////////////////////////////////////////////////////
//	KOSPI200 선물/옵션 현재가 공통 포맷 두번째
typedef struct _REAL_SISE_KS_84003
{
	char	STX					[1];
	C_HEADER				Header;
	TR_HEADER				TRHeader;
	
	char	stk_code			[MAX_STK_CODE];	
	char	gds_code			[2];	// 2	KSF, KSO 구분 2010/07/26 추가
	char	tm					[6];
	char	now_prc				[7];	//	xxxx.xx
	char	open				[7];	//	2	
	char	high				[7];	//	2	
	char	low					[7];	//	2	
	char	acml_cntr_qty		[7];	//	0	누적체결수량
	char	acml_buy_cntr_qty	[6];	//	0	누적매수체결량	//2012.08.22. basis 사용으로 대체.
	char	buy_sell_tp			[1];
	char	acml_amt			[15];	//	0	누적거래대금
	char	daebi_sign			[1];	//	0	전일대비부호
	char	chg					[7];	//	2	전일대비
	char	chg_rate			[7];	//	2	등락율
	char	cntr_qty			[6];	//	0	체결수량
	char	ks200				[7];	//	2	
	char	qty_chg				[9];	//		거래량증감
	char	amt_chg				[9];	//		거래대금증감
	char	open_yak			[7];	//	0	미결제약정수량(부호)-옵션만부호있음
	char	open_yak_chg		[6];	//		미결제약정수량대비 
	char	ETX					[1];
	
}REAL_SISE_KS_84003;		// 220


//////////////////////////////////////////////////////////////////////////
//	해외선물 현재가, 호가 공통 포맷
typedef struct _REAL_SISE_FU
{
	char	STX					[1];
	C_HEADER				Header;
	TR_HEADER				TRHeader;
	
	char	stk_code			[MAX_STK_CODE];	
	char	tm					[6];
	char	nttn_code			[2];
	char	now_prc				[MAX_ORD_PRC];	//	20,8
	char	open				[MAX_ORD_PRC];	//	20,8
	char	high				[MAX_ORD_PRC];	//	20,8
	char	low					[MAX_ORD_PRC];	//	20,8
	char	last_close			[MAX_ORD_PRC];	//	20,8
	char	setl_price			[MAX_ORD_PRC];	//	20,8	
	char	acml_cntr_qty		[MAX_ORD_QTY];	//	0	누적체결수량
	char	acml_buy_cntr_qty	[MAX_ORD_QTY];	//	0	누적매수체결량
	char	acml_amt			[15];	//	0	누적거래대금
	char	daebi_sign			[1];	//	0	전일대비부호
	char	chg					[7];	//	2	전일대비
	char	chg_rate			[7];	//	2	등락율
	char	cntr_qty			[9];	//	0	체결수량
	char	o_hoga_1			[MAX_ORD_PRC];	//	20,8
	char	o_hoga_2			[MAX_ORD_PRC];	//	20,8
	char	o_hoga_3			[MAX_ORD_PRC];	//	20,8
	char	o_hoga_4			[MAX_ORD_PRC];	//	20,8
	char	o_hoga_5			[MAX_ORD_PRC];	//	20,8
	char	o_rmnq_1			[6];	//	0	매도잔량
	char	o_rmnq_2			[6];	//	0	
	char	o_rmnq_3			[6];	//	0	
	char	o_rmnq_4			[6];	//	0	
	char	o_rmnq_5			[6];	//	0
	char	o_trmnq				[6];	//	총매도호가잔량
	char	o_cnt_1				[4];	//	
	char	o_cnt_2				[4];	//	
	char	o_cnt_3				[4];	//	
	char	o_cnt_4				[4];	//	
	char	o_cnt_5				[4];	//	
	char	o_tot_cnt			[5];	//	0	총매도건수
	char	o_hoga_cnt_chg_1	[4];	//	0	매도호가건수대비
	char	o_hoga_cnt_chg_2	[4];	//	0	
	char	o_hoga_cnt_chg_3	[4];	//	0	
	char	o_hoga_cnt_chg_4	[4];	//	0	
	char	o_hoga_cnt_chg_5	[4];	//	0	
	char	b_hoga_1			[MAX_ORD_PRC];	//	20,8
	char	b_hoga_2			[MAX_ORD_PRC];	//	20,8
	char	b_hoga_3			[MAX_ORD_PRC];	//	20,8
	char	b_hoga_4			[MAX_ORD_PRC];	//	20,8
	char	b_hoga_5			[MAX_ORD_PRC];	//	20,8
	char	b_rmnq_1			[6];	//	0	매수잔량
	char	b_rmnq_2			[6];	//	0	
	char	b_rmnq_3			[6];	//	0	
	char	b_rmnq_4			[6];	//	0	
	char	b_rmnq_5			[6];	//	0	
	char	b_trmnq				[6];	//		총매수호가잔량
	char	b_cnt_1				[4];	//	
	char	b_cnt_2				[4];	//	
	char	b_cnt_3				[4];	//	
	char	b_cnt_4				[4];	//	
	char	b_cnt_5				[4];	//	
	char	b_tot_cnt			[5];	//	0	총매수건수
	char	gl_str				[MAX_STK_CODE];
	char	dspl_now_prc		[MAX_ORD_PRC];
	char	ETX					[1];
}REAL_SISE_FU;


//////////////////////////////////////////////////////////////////////////
//	해외선물 현재가, 호가 공통 포맷
typedef struct _REAL_HOGA_FU
{
	char	STX					[1];
	C_HEADER				Header;
	TR_HEADER				TRHeader;
	
	char	stk_code			[MAX_STK_CODE];	
	char	tm					[6];
	char	o_hoga_1			[MAX_ORD_PRC];	//	20,8
	char	o_hoga_2			[MAX_ORD_PRC];	//	20,8
	char	o_hoga_3			[MAX_ORD_PRC];	//	20,8
	char	o_hoga_4			[MAX_ORD_PRC];	//	20,8
	char	o_hoga_5			[MAX_ORD_PRC];	//	20,8
	char	o_rmnq_1			[6];	//	0	매도잔량
	char	o_rmnq_2			[6];	//	0	
	char	o_rmnq_3			[6];	//	0	
	char	o_rmnq_4			[6];	//	0	
	char	o_rmnq_5			[6];	//	0
	char	o_trmnq				[6];	//	총매도호가잔량
	char	o_cnt_1				[4];	//	
	char	o_cnt_2				[4];	//	
	char	o_cnt_3				[4];	//	
	char	o_cnt_4				[4];	//	
	char	o_cnt_5				[4];	//	
	char	o_tot_cnt			[5];	//	0	총매도건수
	char	b_hoga_1			[MAX_ORD_PRC];	//	20,8
	char	b_hoga_2			[MAX_ORD_PRC];	//	20,8
	char	b_hoga_3			[MAX_ORD_PRC];	//	20,8
	char	b_hoga_4			[MAX_ORD_PRC];	//	20,8
	char	b_hoga_5			[MAX_ORD_PRC];	//	20,8
	char	b_rmnq_1			[6];	//	0	매수잔량
	char	b_rmnq_2			[6];	//	0	
	char	b_rmnq_3			[6];	//	0	
	char	b_rmnq_4			[6];	//	0	
	char	b_rmnq_5			[6];	//	0	
	char	b_trmnq				[6];	//		총매수호가잔량
	char	b_cnt_1				[4];	//	
	char	b_cnt_2				[4];	//	
	char	b_cnt_3				[4];	//	
	char	b_cnt_4				[4];	//	
	char	b_cnt_5				[4];	//	
	char	b_tot_cnt			[5];	//	0	총매수건수
	
	char	ETX					[1];
	
}REAL_HOGA_FU;


//////////////////////////////////////////////////////////////////////////
//	FX마 현재가, 호가 공통 포맷
typedef struct _REAL_SISE_FX
{
	char	STX					[1];
	C_HEADER				Header;
	TR_HEADER				TRHeader;

	char	stk_code			[MAX_STK_CODE];	
	char	tm					[6];
	char	nttn_code			[2];
	char	o_now_prc			[11];	//	20,8
	char	b_now_prc			[11];	//	20,8
	char	spread_sign			[1];
	char	spread				[11];
	char	o_open				[11];
	char	b_open				[11];
	char	open				[11];
	char	o_high				[11];
	char	b_high				[11];
	char	high				[11];
	char	o_low				[11];
	char	b_low				[11];
	char	low					[11];
	char	o_intr				[11];	//	11,2
	char	b_intr				[11];	//	11,2
	char	pip_value			[11];	//	11,2
	
	char	ETX					[1];
	
}REAL_SISE_FX;

/***********************************************************************

	COMPONENT(컴포넌트) 용 패킷 정의 (정렬순서 : TR번호순)

***********************************************************************/

///////////////////////////////////////////////////////////////////////////
//	계좌조회 화면: X1TR00015 :  화면번호 (????)

typedef struct _ST_TR_00015_I
{
	char	UserID		[MAX_USERID];	//	사용자ID
}ST_TR_00015_I;

typedef struct _ST_TR_00015_O
{
	char	UserID		[MAX_USERID];	//	사용자ID
	char	Acnt_No_Ks	[MAX_ACNT_NO];	//	계좌번호 (KS) 예: 00-00-00000 (11자리)
	char	Acnt_Nm_Ks	[20];			//	계좌명 (KS)
	char	Acnt_Pwd_Ks	[4];			//	계좌비밀빈호 (KS)
	char	Acnt_No_Fu	[MAX_ACNT_NO];	//	계좌번호 (FU)
	char	Acnt_Nm_Fu	[20];			//	계좌명 (FU)
	char	Acnt_Pwd_Fu	[4];			//	계좌비밀빈호 (FU)
	char	Acnt_No_Fx	[MAX_ACNT_NO];	//	계좌번호 (FX)
	char	Acnt_Nm_Fx	[20];			//	계좌명 (FX)
	char	Acnt_Pwd_Fx	[4];			//	계좌비밀빈호 (FX)
}ST_TR_00015_O;

